Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: 2.Dead-end aisles longer than 16 rows are permitted where seats beyond the 16th row dead-end aisle are not more than 24 seats from another aisle, measured along a row of seats having a minimum clear width of 12 inches (305 mm) plus 0.6 inch (15.2 mm) for each additional seat above seven in the row where seats have backrests or beyond 10 where seats are without backrests in the row.
fr_ca: 2. Les allées sans issue de plus de 16 rangées sont autorisées lorsque les sièges situés au-delà de la 16e rangée de l’allée sans issue ne sont pas à plus de 24 sièges d’une autre allée, la distance étant mesurée le long d’une rangée de sièges ayant une largeur libre minimale de 12 po (305 mm), plus 0,6 po (15,2 mm) pour chaque siège supplémentaire au-delà de sept dans la rangée lorsque les sièges sont munis de dossiers, ou au-delà de 10 lorsque les sièges ne sont pas munis de dossiers.

source: 2.Decorative glazing.
fr_ca: 2. Vitrage décoratif.

source: 2.Emergency escape and rescue openings are not required from basements or sleeping rooms that have an exit door or exit access door that opens directly into a public way or to a yard, court or exterior egress balcony that opens to a public way.
fr_ca: 2. Les ouvertures d'évacuation et de sauvetagene sont pas exigées dans les sous-sols ou les chambres à coucher qui comportent une porte d’issue ou une porte d’accès à l’issue donnant directement sur une voie publique ou sur une cour, un espace extérieur ou un balcon d’évacuation extérieur donnant sur une voie publique.

source: 2.Existing elevators shall not be required to comply with Section 407.2.1.5.
fr_ca: 2. Les ascenseurs existants ne sont pas tenus de se conformer à la section 407.2.1.5.

source: 2.Existing elevators shall not be required to comply with Section 407.2.2.2.
fr_ca: 2. Les ascenseurs existants ne sont pas tenus de se conformer à la section 407.2.2.2.

source: 2.Fire protection systems.
fr_ca: 2. Systèmes de protection contre l’incendie.

source: 2.For nonflammable gases, a gas concentration exceeding one-half of the IDLH, unless a different threshold is specified by the section of this code requiring a gas detection system.
fr_ca: 2. Pour les gaz ininflammables, une concentration de gaz supérieure à la moitié de la valeur IDLH, à moins qu’un seuil différent ne soit spécifié par la section du présent code exigeant un système de détection de gaz.

source: 2.For other than fire service access elevators and occupant evacuation elevators, in buildings four stories or less above grade plane where machine room, machinery spaces, control rooms and control spaces do not abut and do not have openings to the hoistway enclosure they serve, the machine room, machinery spaces, control rooms and control spaces are not required to be fire-resistance rated.
fr_ca: 2. Pour les ascenseurs autres que les ascenseurs destinés à l’accès du service d’incendie et les ascenseurs destinés à l’évacuation des occupants, dans les bâtiments de quatre étages ou moins au-dessus du plan de référence du sol, lorsque les locaux des machines, les locaux de machinerie, les locaux de commande et les espaces de commande ne sont pas attenants à l’enceinte du puits qu’ils desservent et ne comportent pas d’ouvertures donnant sur celle-ci, les locaux des machines, les locaux de machinerie, les locaux de commande et les espaces de commande ne sont pas tenus d’avoir un degré de résistance au feu.

source: 2.For the maneuvering clearance at swinging doors for the front approach direction on the push side, the dimension perpendicular to the door shall be 48 inches (1220 mm) minimum.
fr_ca: 2. Pour le dégagement de manœuvre aux portes à charnières pour la direction d'approche avant du côté poussée, la dimension perpendiculaire à la porte doit être d'au moins 48 po [1220 mm].

source: 2.For toxic gases that are not HPM, sample analysis shall be performed at intervals not exceeding 5 minutes in accordance with Section 6004.2.2.7 of the International Fire Code.
fr_ca: 2. Pour les gaz toxiques qui ne sont pas des gaz HPM, l’analyse des échantillons doit être effectuée à des intervalles d’au plus 5 minutes conformément à la section 6004.2.2.7 de l’International Fire Code.

source: 2.Glazing 36 inches (914 mm) or more measured horizontally from the walking surface.
fr_ca: 2. Vitrage de 36 po (914 mm) ou plus mesuré horizontalement à partir de la surface de marche.

source: 2.Group R-3 and R-4 occupancies.
fr_ca: 2. Usages des groupes R-3 et R-4.

source: 2.Handrails are not required where, at the side of the aisle, there is a guard with a top surface that complies with the graspability requirements of handrails in accordance with Section 1014.3.
fr_ca: 2. Les mains courantes ne sont pas exigées lorsque, sur le côté de l’allée, se trouve un garde-corps dont la surface supérieure est conforme aux exigences relatives à la préhension des mains courantes de la section 1014.3.

source: 2.In Group R-1, R-2 or R-3 occupancies, exit access stairways and ramps connecting four stories or less serving and contained within an individual dwelling unit or sleeping unit or live/work unit.
fr_ca: 2. Dans les usages des groupes R-1, R-2 ou R-3, les escaliers et rampes d’accès aux issues reliant au plus quatre étages, desservant une unité de logement individuelle, une unité de couchage individuelle ou une unité de travail et logement et étant situés à l’intérieur de cette unité.

source: 2.In a building, room or space used for assembly purposes or portions thereof with seating at tables and without ramped or tiered floors for seating, the seats shall not be required to be fastened to the floor.
fr_ca: 2. Dans un bâtiment, une pièce ou un espace utilisé à des fins d’assemblée, ou dans une partie de ceux-ci, qui comporte des sièges disposés autour de tables et qui ne comporte pas de planchers en pente ou en gradins pour les sièges, les sièges ne sont pas tenus d’être fixés au plancher.

source: 2.In a kitchen where two or more receptacle outlets are provided above a length of countertop that is uninterrupted by a sink or appliance, only one receptacle outlet shall be required to comply with this section.
fr_ca: 2. Dans une cuisine où deux prises de courant ou plus sont prévues au-dessus d'une longueur de comptoir qui n'est pas interrompue par un évier ou un appareil, une seule prise de courant doit être conforme à la présente section.

source: 2.In assembly areas with ramped aisles or stepped aisles, one accessible means of egress is permitted where the common path of egress travel is accessible and meets the requirements in Section 1030.8.
fr_ca: 2. Dans les aires de rassemblement comportant des allées en pente ou des allées à gradins, un moyen d'évacuation accessible est autorisé lorsque le parcours commun d'évacuation est accessible et satisfait aux exigences de l'article 1030.8.

source: 2.In buildings equipped throughout with an automatic sprinkler system installed in accordance with Section 903.3.1.1 or 903.3.1.2, the elevator shall not be required on floors provided with a ramp conforming to the provisions of Section 1012.
fr_ca: 2. Dans les bâtiments entièrement équipés d’un système d’extincteurs automatiques installé conformément à la section 903.3.1.1 ou 903.3.1.2, l’ascenseur n’est pas requis aux étages comportant une rampe conforme aux dispositions de la section 1012.

source: 2.In existing elevators, a signal indicating the direction of car travel shall not be required.
fr_ca: 2. Dans les ascenseurs existants, un signal indiquant le sens de déplacement de la cabine n'est pas exigé.

source: 2.In other than Group F-1, H-2, H-3, H-5, M and S-1 occupancies, the fire-resistance rating of the building elements in Type IB construction shall be permitted to be reduced to the fire-resistance ratings in Type IIA.
fr_ca: 2. Dans les occupations autres que celles des groupes F-1, H-2, H-3, H-5, M et S-1, le degré de résistance au feu des éléments du bâtiment de construction de type IB peut être réduit aux degrés de résistance au feu applicables au type IIA.

source: 2.Installation, alteration or repairs of plumbing or mechanical systems.
fr_ca: 2. Installation, modification ou réparation de systèmes de plomberie ou de systèmes mécaniques.

source: 2.Interior exit stairways complying with Sections 1009.3 and 1023.
fr_ca: 2. Escaliers d'issue intérieurs conformes aux sections 1009.3 et 1023.

source: 2.Interior exit stairways within an atrium enclosed in accordance with Section 404.6.
fr_ca: 2. Escaliers d'issue intérieurs dans un atrium encloisonné selon la section 404.6.

source: 2.Is fully accessible by the deaf, hard of hearing and speech impaired, and shall include voice-only options for hearing individuals.
fr_ca: 2. Est entièrement accessible aux personnes sourdes, malentendantes et ayant des troubles de la parole, et doit inclure des options vocales uniquement pour les personnes entendantes.

source: 2.Lifts serving two landings maximum and having doors or gates on adjacent sides shall be permitted to have self-closing manual doors or gates provided that the side door or gate is located with the strike side furthest from the end door.
fr_ca: 2. Les ascenseurs desservant au plus deux paliers et ayant des portes ou des portillons sur des côtés adjacents peuvent avoir des portes ou des portillons manuels à fermeture automatique, à condition que la porte ou le portillon latéral soit situé avec le côté de la gâche le plus éloigné de la porte d'extrémité.

source: 2.Mirrors and other glass panels mounted or hung on a surface that provides a continuous backing support.
fr_ca: 2. Miroirs et autres panneaux de verre montés ou suspendus sur une surface qui fournit un support continu.

source: 2.Not less than 0.005 inch (0.127 mm) of additional aisle capacity for each occupant shall be provided for each 0.10 inch (2.5 mm) of riser height above 7 inches (178 mm).
fr_ca: 2. Une capacité d'allée supplémentaire d'au moins 0,005 po (0,127 mm) de par occupant doit être prévu pour chaque 0,10 po (2,5 mm) de hauteur de contremarche au-dessus de 7 po (178 mm).

source: 2.One of the following is not required to be on an accessible route:
fr_ca: 2. L'un des éléments suivants n'est pas tenu d'être situé sur un itinéraire accessible :

source: 2.One or more care recipients that are incapable of self-preservation are located at other than the level of exit discharge serving such a facility.
fr_ca: 2. Un ou plusieurs bénéficiaires de soins ou plus sont incapables de se protéger eux-mêmes se trouvent à un niveau autre que le niveau d’évacuation menant à l’extérieur desservant l’établissement.

source: 2.Open parking garages in accordance with Section 406.5.
fr_ca: 2. Garages de stationnement ouverts conformément à l’article 406.5.

source: 2.Other portions of the building.
fr_ca: 2. Autres parties du bâtiment.

source: 2.Outside each separate sleeping area in the immediate vicinity of the bedrooms.
fr_ca: 2. À l'extérieur de chaque aire de repos séparée, à proximité immédiate des chambres à coucher.

source: 2.Press boxes and storage facilities less than 1,000 square feet (93 m2) in area.
fr_ca: 2. Tribunes de presse et installations d'entreposage de moins de 1000 pi2 (93 m2).

source: 2.Riser heights not exceeding 9 inches (229 mm) shall be permitted where they are necessitated by the slope of the adjacent seating areas to maintain sightlines.
fr_ca: 2. Des hauteurs des contremarches ne dépassant pas 9 po (229 mm) sont autorisées lorsqu'elles sont rendues nécessaires par la pente des zones de sièges adjacentes pour maintenir les lignes de visibilité.

source: 2.Separation between an interior exit stairway or ramp and the exit passageway extension shall not be required where there are no openings into the exit passageway extension.
fr_ca: 2. Une séparation entre un escalier ou une rampe d’issue intérieurs et le prolongement du passage d’issue n’est pas requise lorsqu’il n’y a aucune ouverture donnant sur le prolongement du passage d’issue.

source: 2.Tempered spandrel glass is permitted to be identified by the manufacturer with a removable paper designation.
fr_ca: 2. Le verre trempé pour tympan peut être identifié par le fabricant au moyen d'une désignation amovible en papier.

source: 2.The Group E fire area is located on a floor other than a level of exit discharge serving such occupancies.
fr_ca: 2. La zone d'incendie du Groupe E est située à un étage autre que le niveau de l'issue d'évacuation desservant ces usages.

source: 2.The area shall be located on the same lot not less than 50 feet (15 240 mm) away from the building requiring egress.
fr_ca: 2. La zone doit être située sur le même lot, à au moins 50 pi (15 240 mm) du bâtiment nécessitant une évacuation.

source: 2.The back-wall grab bar is not required to extend within 6 inches (150 mm) of the adjacent side wall opposite the seat if it would require the grab bar length to exceed 48 inches (1220 mm) in length.
fr_ca: 2. Il n'est pas exigé que la barre d'appui du mur arrière se prolonge à moins de 6 po [150 mm] de la paroi latérale adjacente opposée au siège si cela nécessiterait que la longueur de la barre d'appui dépasse 48 po [1220 mm].

source: 2.The bottom edge of the glazing is less than 18 inches (457 mm) above the floor.
fr_ca: 2. Le bord inférieur du vitrage est à moins de 18 po (457 mm) au-dessus du sol.

source: 2.The clear width of 48 inches (1219 mm) between handrails is not required for stairways accessed from a refuge area in conjunction with a horizontal exit.
fr_ca: 2. La largeur libre de 48 po (1219 mm) entre les mains courantes n'est pas exigée pour des escaliers accessibles à partir d’une aire de refuge dans le cadre d’une issue horizontale.

source: 2.The emergency sign shall not be required for elevators that are used for occupant self-evacuation in accordance with Section 3008.
fr_ca: 2. Le panneau d'urgence n'est pas exigé pour les ascenseurs utilisés pour l'auto-évacuation des occupants selon la section 3008.

source: 2.The enclosed area exceeds 1,000 square feet (93 m2).
fr_ca: 2. La zone fermée dépasse 1000 pi2 [93 m 2].

source: 2.The fire area has an occupant load of 300 or more.
fr_ca: 2. La zone d'incendie a une charge d'occupants de 300 ou plus.

source: 2.The fire barrier separating the smokeproof enclosure from the exit passageway is not required, provided that the exit passageway is protected and pressurized in the same manner as the smokeproof enclosure.
fr_ca: 2. La barrière coupe-feu entre l’enceinte à l’épreuve de la fumée et le passage d’issue n’est pas exigée, à condition que le passage d’issue soit protégé et mis en surpression de la même manière que l’enceinte à l’épreuve de la fumée.

source: 2.The floor finish extends under the cabinetry, and
fr_ca: 2. La finition du plancher s'étend sous l'armoire, et

source: 2.The glazed areas need not be installed in rooms where Exception 1 is satisfied and artificial light is provided that is capable of producing an average illumination of 6 footcandles (65 lux) over the area of the room at a height of 30 inches (762 mm) above the floor level.
fr_ca: 2. Les surfaces vitrées n’ont pas besoin d’être installées dans les pièces lorsque l’exception 1 est respectée et qu’un éclairage artificiel est fourni, capable de produire un éclairement moyen de 6 pieds-bougies (65 lux) sur la superficie de la pièce, à une hauteur de 30 po (762 mm) au-dessus du niveau du plancher.

source: 2.The headroom for spiral stairways shall be in accordance with Section R311.7.10.1.
fr_ca: 2. La hauteur libre des escaliers en colimaçon doit être conforme à la section R311.7.10.1.

source: 2.The letters designating the identification of the interior exit stairway and ramp shall be not less than 11/2 inches (38 mm) in height.
fr_ca: 2. Les lettres désignant l'identification de l'escalier et de la rampe d'issue intérieurs ne doivent pas être d'une hauteur inférieure à 11/2 po (38 mm).

source: 2.The requirement for the frequency and range of audible signals shall not apply in existing elevators.
fr_ca: 2. L'exigence relative à la fréquence et à la portée des signaux sonores ne s'applique pas aux ascenseurs existants.

source: 2.The restriction on objects beneath call buttons shall not apply to existing call buttons.
fr_ca: 2. La restriction relative aux objets situés sous les boutons d'appel ne doit pas s'appliquer aux boutons d'appel existants.

source: 2.Thirty inches (762 mm) where the aisle serves less than 15 seats and does not serve as part of an accessible route.
fr_ca: 2. Trente pouces (762 mm) lorsque l'allée dessert moins de 15 sièges et ne fait pas partie d'un itinéraire accessible.

source: 2.Thirty-six inches (914 mm) for stepped aisles having seating on only one side.
fr_ca: 2. Trente-six pouces (914 mm) pour les allées en escalier ayant des sièges d'un seul côté.

source: 2.Vents and chimneys serving fuel-burning appliances shall be terminated in accordance with the applicable provisions of Chapters 18 and 24.
fr_ca: 2. Les évents et les cheminées desservant des appareils à combustion doivent déboucher conformément aux dispositions applicables des chapitres 18 et 24.

source: 2.Visual characters on VMS signage shall comply with Section 703.7, or
fr_ca: 2. Les caractères visuels sur la signalisation VMS doivent être conformes à la section 703.7, ou

source: 2.Where a horizontal rail is installed on the accessible side(s) of the glazing 34 to 38 inches (864 to965 mm) above the walking surface.
fr_ca: 2. Lorsqu'une main courante horizontale est installée sur le(s) côté(s) accessible(s) du vitrage, de 34 à 38 po (864 à 965 mm) au-dessus de la surface de marche.

source: 2.Where an accessible route makes a 180-degree turn around an object that is less than 48 inches (1220 mm) in width, clear widths shall be 42 inches (1065 mm) minimum approaching the turn, 48 inches (1220 mm) minimum during the turn and 42 (1065 mm) inches minimum leaving the turn.
fr_ca: 2. Lorsqu'un itinéraire accessible effectue un virage à 180 degrés autour d'un objet d'une largeur inférieure à 48 po [1220 mm], les largeurs libres doivent être d'au moins 42 po [1065 mm] à l'approche du virage, d'au moins 48 po [1220 mm] pendant le virage et d'au moins 42 po [1065 mm] à la sortie du virage.

source: 2.Where glazing is adjacent to a walking surface and a horizontal rail is installed 34 to 38 inches (864 to 965 mm) above the walking surface.
fr_ca: 2. Lorsque le vitrage est adjacent à une surface de marche et qu'une rampe horizontale est installée de 34 à 38 po [864 à 965 mm] au-dessus de la surface de marche.

source: 2.Where sleeping units are constructed as suites, walls between bedrooms within the sleeping unit and the walls between the bedrooms and associated living spaces are not required to be constructed as fire partitions.
fr_ca: 2. Lorsque les unités de couchage sont aménagées en suites, les murs entre les chambres à l’intérieur de l’unité de couchage ainsi que les murs entre les chambres et les espaces de séjour correspondants ne sont pas tenus d’être construits comme des cloisons coupe-feu.

source: 2.Where such equipment and ductwork is located within the interior exit stairway and ramp, the intake air shall be taken directly from the outdoors and the exhaust air shall be discharged directly to the outdoors, or such air shall be conveyed through ducts enclosed in construction as required for shafts.
fr_ca: 2. Lorsque ces équipements et ces conduits sont situés à l’intérieur de l’escalier et de la rampe d’issue intérieure, l’air d’admission doit être prélevé directement de l’extérieur et l’air d’évacuation doit être rejeté directement à l’extérieur, ou cet air doit être acheminé par des conduits enfermés dans une construction conforme aux exigences applicables aux puits.

source: 2.Where the controls and hand shower are located on the side wall adjacent to the seat, the controls and hand shower shall be 16 inches (405 mm) minimum and 27 inches (685 mm) maximum from the wall behind the seat wall, or
fr_ca: 2. Lorsque les commandes et la douchette sont situées sur la paroi latérale adjacente au siège, les commandes et la douchette doivent être situées à une distance comprise entre 16 po [405 mm] et 27 po [685 mm] du mur derrière le mur du siège, ou

source: 2.Where the enclosed parking garage in accordance with Section 406.6 is located beneath other groups.
fr_ca: 2. Lorsque le garage de stationnement fermé selon la section 406.6 est situé sous d'autres groupes.

source: 2.Where the glazing is on a wall less than 180 degrees (3.14 rad) from the plane of the door in a closed position and within 24 inches (610 mm) of the hinge side of an in-swinging door.
fr_ca: 2. Lorsque le vitrage est sur un mur à moins de 180 degrés (3,14 rad) du plan de la porte en position fermée et à moins de 24 po [610 mm] du côté charnière d'une porte battante vers l'intérieur.

source: 2.Where the ramp is not a part of an accessible route, the length of the landing shall not be required to be more than 48 inches (1219 mm) in the direction of travel.
fr_ca: 2. Lorsque la rampe ne fait pas partie d’un itinéraire accessible, la longueur du palier dans la direction de déplacement n’est pas tenue d’être supérieure à 48 pouces (1 219 mm).

source: 2.Where there is an intervening wall or other permanent barrier between the door and glazing.
fr_ca: 2. Lorsqu'il y a un mur intermédiaire ou une autre barrière permanente entre la porte et le vitrage.

source: 2.Where there is an intervening wall or other permanent barrier between the door and the glazing.
fr_ca: 2. Lorsqu'il y a un mur intermédiaire ou une autre barrière permanente entre la porte et le vitrage.

source: 2.Carbon monoxide alarms installed in accordance with Section R315.2.2 shall be permitted to be battery powered.
fr_ca: 2. Les détecteurs de monoxyde de carbone installés selon la section R315.2.2 peuvent être alimentés par batterie.

source: 2.Eave projections shall not be considered as obstructing the clear open space of a yard or court.
fr_ca: 2. Les saillies d'avant-toit ne doivent pas être considérées comme obstruant l'espace libre d'une cour ou d'un jardin.

source: 2.Ionization smoke alarms with an alarm-silencing switch shall not be installed less than 10 feet (3048 mm) horizontally from a permanently installed cooking appliance.
fr_ca: 2. Les détecteurs de fumée à ionisation dotés d'un interrupteur de mise en sourdine de l'alarme ne doivent pas être installés à moins de 10 pieds (3 048 mm) horizontalement d'un appareil de cuisson installé de façon permanente.

source: 2.Smoke alarms installed in accordance with Section R314.2.2 shall be permitted to be battery powered.
fr_ca: 2. Les détecteurs de fumée installés selon la section R314.2.2 peuvent être alimentés par batterie.

source: 2.The dwelling unit has an attached garage with an opening that communicates with the dwelling unit.
fr_ca: 2. L'unité d'habitation a un garage attenant avec une ouverture qui communique avec l'unité d'habitation.

source: 2.The riser height of spiral stairways shall be in accordance with Section R311.7.10.1.
fr_ca: 2. La hauteur des contremarches des escaliers en colimaçon doit être conforme à la section R311.7.10.1.

source: 2.Windows in bathrooms shall not be required to comply with Section 1103.13.
fr_ca: 2. Les fenêtres des salles de bain ne sont pas tenues de se conformer à la section 1103.13.

source: 20 inches (510 mm)3
fr_ca: 20 po [510 mm]3

source: 20, plus 1 for each 100, or fraction thereof, over 1,000
fr_ca: 20, plus 1 pour chaque tranche de 100, ou fraction de celle-ci, au-delà de 1 000

source: 201 to 300
fr_ca: 201 à 300

source: 21 feet (6400 mm) and greater
fr_ca: 21 pi [6400 mm] et plus

source: 21 inches (535 mm)
fr_ca: 21 po [535 mm]

source: 22 inches (560 mm)
fr_ca: 22 po [560 mm]

source: 22,000 and greater
fr_ca: 22 000 et plus
